#+AUTHOR: Lucas M. Schnorr
#+STARTUP: overview indent content

* 2026-03-29
:PROPERTIES:
:header-args: :tangle "do-2026-03-29.R" :tangle-mode (identity #o755) :shebang "#!/usr/bin/Rscript"
:END:
** Ler e primeira tentativa de análise

#+begin_src R :results output :session *R* :exports both :noweb yes :colnames yes :tangle ops-histogram.R
options(crayon.enabled=FALSE)
suppressMessages(library(tidyverse))
library(readr)
library(dplyr)
library(stringr)

cols <- c(
  "State", "Container", "Type", "Start",
  "End", "Duration", "Depth", "Operation"
)

ops_regex <- paste(
  c(
    "Send", "Recv", "Isend", "Irecv", "Ssend", "Bsend", "Rsend",
    "Wait", "Waitall", "Waitany", "Waitsome", "Test",
    "Barrier", "Bcast", "Reduce", "Allreduce",
    "Gather", "Allgather", "Scatter", "Alltoall",
    "Scan", "Exscan"
  ),
  collapse = "|"
)

arquivos <- c("rastro-real-minivite64.csv", "rastro-sim-minivite64.csv")

dados <- map_dfr(arquivos, function(arq) {
  
  linhas <- read_lines(arq, progress = FALSE)
  linhas_state <- linhas[str_starts(linhas, "State")]
  
  read_csv(
    I(linhas_state),
    col_names = cols,
    progress = FALSE,
    show_col_types = FALSE
  ) |>
    mutate(
      File = arq,
      Rank = as.integer(gsub("rank-?", "", Container))
    ) |>
    mutate(Operation = gsub("^P", "", Operation)) |>
    select(File, Rank, Start, End, Duration, Operation) |>
    filter(str_detect(Operation, ops_regex))
})
dados |>
  ggplot(aes(x = Duration, fill=File)) +
  geom_histogram(alpha=.4, bins=100) +
  theme_bw(base_size=12) +
  facet_wrap(~Operation)

dados |>
  group_by(File, Operation) |>
  summarize(N = n(),
            Mean = mean(Duration),
            SD = sd(Duration)) |>
  arrange(Operation)
#+end_src

#+RESULTS:
#+begin_example
`summarise()` has grouped output by 'File'. You can override using the
`.groups` argument.
# A tibble: 18 × 5
# Groups:   File [2]
   File                       Operation         N        Mean         SD
   <chr>                      <chr>         <int>       <dbl>      <dbl>
 1 rastro-real-minivite64.csv MPI_Allreduce  1408 0.000237    0.0000432 
 2 rastro-sim-minivite64.csv  MPI_Allreduce  1408 0.000535    0.000304  
 3 rastro-real-minivite64.csv MPI_Alltoall   2624 0.00155     0.00135   
 4 rastro-sim-minivite64.csv  MPI_Alltoall   2624 0.000806    0.000275  
 5 rastro-real-minivite64.csv MPI_Barrier    1088 0.00147     0.00478   
 6 rastro-sim-minivite64.csv  MPI_Barrier    1088 0.000570    0.00174   
 7 rastro-real-minivite64.csv MPI_Bcast        64 0.00346     0.0000205 
 8 rastro-sim-minivite64.csv  MPI_Bcast        64 0.000121    0.0000831 
 9 rastro-real-minivite64.csv MPI_Irecv     10206 0.000000434 0.00000149
10 rastro-sim-minivite64.csv  MPI_Irecv     10206 0           0         
11 rastro-real-minivite64.csv MPI_Isend     10206 0.00000283  0.00000314
12 rastro-sim-minivite64.csv  MPI_Isend     10206 0           0         
13 rastro-real-minivite64.csv MPI_Reduce      384 0.0000206   0.0000542 
14 rastro-sim-minivite64.csv  MPI_Reduce      384 0.00000427  0.0000409 
15 rastro-real-minivite64.csv MPI_Sendrecv    896 0.0000668   0.000185  
16 rastro-sim-minivite64.csv  MPI_Sendrecv    880 0.0000371   0.0000924 
17 rastro-real-minivite64.csv MPI_Waitall   10368 0.0000445   0.0000727 
18 rastro-sim-minivite64.csv  MPI_Waitall   10368 0.0000301   0.0000819
#+end_example

** Ver o gantt-chart

#+begin_src R :results output :session *R* :exports both :noweb yes :colnames yes
dados |>  
  mutate(File = str_extract(File, "real|sim")) |>
  filter(str_detect(Operation, ops_regex)) |>
  ggplot(aes(xmin = Start, xmax = End,
             ymin = Rank, ymax=Rank+0.9,
             fill = Operation)) +
  geom_rect() +
  facet_wrap(~File, ncol=1)
#+end_src

#+RESULTS:

Vemos que o real levou mais tempo.

** Quantificar o tempo gasto por operação MPI por caso

#+begin_src R :results output :session *R* :exports both :noweb yes :colnames yes
dados |>
  mutate(File = str_extract(File, "real|sim")) -> dados.aux
dados.aux |>
  group_by(File) |>
  summarize(Makespan = max(End) * length(unique(Rank))) -> dados.makespan
dados.aux |>
  filter(str_detect(Operation, ops_regex)) |>
  group_by(File, Operation) |>
  summarize(Total = sum(Duration), .groups="keep") |>
  arrange(Operation) |>
  pivot_wider(
    names_from = File,
    values_from = c(Total)
  ) |>
  mutate(dif = real - sim)
#+end_src

#+RESULTS:
#+begin_example
# A tibble: 9 × 4
# Groups:   Operation [9]
  Operation        real     sim      dif
  <chr>           <dbl>   <dbl>    <dbl>
1 MPI_Allreduce 0.333   0.753   -0.420  
2 MPI_Alltoall  4.06    2.12     1.94   
3 MPI_Barrier   1.60    0.620    0.983  
4 MPI_Bcast     0.222   0.00773  0.214  
5 MPI_Irecv     0.00443 0        0.00443
6 MPI_Isend     0.0289  0        0.0289 
7 MPI_Reduce    0.00793 0.00164  0.00629
8 MPI_Sendrecv  0.0598  0.0327   0.0272 
9 MPI_Waitall   0.461   0.312    0.149
#+end_example

Vemos que todas as operações levam mais tempo no real, salvo allreduce.

** Quantificar a duração por rank de cada operação MPI e compute

#+begin_src R :results output :session *R* :exports both :noweb yes :colnames yes
dados |>
  mutate(File = str_extract(File, "real|sim")) |>
  group_by(File, Rank) |>
  arrange(Start) |>
  mutate(Start.Next = lead(Start)) |>
  filter(!is.na(Start.Next)) |>
  mutate(Operation = "Compute") |>
  mutate(Duration = Start.Next - End) |>
  select(File, Rank, Start = End, End = Start.Next, Duration, Operation) -> dados.compute
bind_rows(dados |>
        mutate(File = str_extract(File, "real|sim")), dados.compute) -> dados.all
dados.all |>
  group_by(File, Operation) |>
  mutate(Makespan = max(End)) |>
  group_by(File, Operation, Makespan) |>  
  summarize(Total.Operation = sum(Duration) / length(unique(Rank)), .groups="keep") |>
  mutate(P = round(Total.Operation / Makespan * 100, 2)) |>
  arrange(-P)
#+end_src

#+RESULTS:
#+begin_example
# A tibble: 30 × 5
# Groups:   File, Operation, Makespan [30]
   File  Operation     Makespan Total.Operation     P
   <chr> <chr>            <dbl>           <dbl> <dbl>
 1 sim   Compute        0.289          0.229    79.2 
 2 real  Compute        0.337          0.227    67.4 
 3 real  MPI_Alltoall   0.336          0.0634   18.9 
 4 real  MPI_Bcast      0.0273         0.00346  12.7 
 5 real  MPI_Finalize   0.390          0.0468   12   
 6 sim   MPI_Alltoall   0.288          0.0331   11.5 
 7 sim   MPI_Bcast      0.00145        0.000121  8.32
 8 real  MPI_Barrier    0.337          0.0250    7.43
 9 sim   MPI_Allreduce  0.288          0.0118    4.08
10 sim   MPI_Barrier    0.289          0.00969   3.35
# ℹ 20 more rows
# ℹ Use `print(n = ...)` to see more rows
#+end_example

We can see clearly that Compute takes the majority of the time, in
average ~80% of the time. That means that any Compute difference might
have a significant impact in the differences we can see in simulation
against reality.

** Comparar unicamente os tempos de cálculo entre real e sim

#+begin_src R :results output :session *R* :exports both :noweb yes :colnames yes
dados |>
  mutate(File = str_extract(File, "real|sim")) |>
  group_by(File, Rank) |>
  arrange(Start) |>
  mutate(Start.Next = lead(Start)) |>
  filter(!is.na(Start.Next)) |>
  mutate(Operation = "Compute") |>
  mutate(Duration = Start.Next - End) |>
  select(File, Rank, Start = End, End = Start.Next, Duration, Operation) |>
  group_by(File, Rank) |>
  summarize(Total = sum(Duration), .groups="keep") |>
  ggplot(aes(x = Rank, y = Total)) +
  geom_point() +
  ylim(0, NA) +
  facet_wrap(~File)
#+end_src

#+RESULTS:

There is indeed a much "stable" behavior in compute time per rank in
the simulation when compared against reality. But those values around
~0.23 are somehow within the range of reality. There is still the rank
0 and 64 different behavior that simulation captures well (a bit not
optimistic thou).

Let's see how this things add up along the simulation.

#+begin_src R :results output :session *R* :exports both :noweb yes :colnames yes
dados |>
  mutate(File = str_extract(File, "real|sim")) |>
  group_by(File, Rank) |>
  arrange(Start) |>
  mutate(Start.Next = lead(Start)) |>
  filter(!is.na(Start.Next)) |>
  mutate(Operation = "Compute") |>
  mutate(Duration = Start.Next - End) |>
  select(File, Rank, Start = End, End = Start.Next, Duration, Operation) |>
  select(File, Rank, Start, Duration) |>
  arrange(Start) |>
  mutate(Cumulative.Duration = cumsum(Duration)) |>
  ggplot(aes(x = Start, y = Cumulative.Duration, group=Rank, color=Rank)) +
  geom_line(alpha=.3) +
  geom_point() +  
  facet_wrap(~File, ncol=1)
#+end_src

#+RESULTS:

Since we identified that Compute takes roughly ~80% of time. My
hypothesis indicate that are not the differences of MPI operations
that explain the difference between reality and simulation. It is the
compute. Indeed, when the compute of reality takes place, there is a
lot of concurrency involved (competition). While in simulation, the
compute is alone in the machine, so it gets faster.
